blog/awesome-repos.org
#+TITLE:       Awesome Tools
#+AUTHOR:      Sean Wang
#+EMAIL:       sean@think.sean.org
#+DATE:        2016-01-07 Thu
#+URI:         /blog/%y/%m/%d/awesome-repos
#+KEYWORDS:    github, repository
#+TAGS:        github
#+LANGUAGE:    en
#+OPTIONS:     H:3 num:nil toc:nil \n:nil ::t |:t ^:nil -:nil f:t *:t <:t
#+DESCRIPTION: awesome tools

* Percol
Percol is a command line tool that adds flavor of interactive filtering to the
traditional pipe concept of UNIX shell.

on Github: [[https://github.com/mooz/percol.git][https://github.com/mooz/percol.git]]

#+BEGIN_SRC shell
git clone https://github.com/mooz/percol.git
#+END_SRC

* oh-my-zsh

#+BEGIN_SRC shell
sh -c "$(curl -fsSL https://raw.github.com/robbyrussell/oh-my-zsh/master/tools/install.sh)"
#+END_SRC
* GNU Parallel
GNU *parallel* is a shell tool for executing jobs in parallel using one or more
computers.

Downloading: [[http://ftp.gnu.org/gnu/parallel/][http://ftp.gnu.org/gnu/parallel/]] 
* tmux
A terminal multiplexer.

[[https://tmux.github.io][https://tmux.github.io]]
