blog/2016/01/07/awesome-repos/index.html
<!DOCTYPE html>
<html lang="en-us">
<head>
  <title>Awesome Tools - Sean Wang&#39;s Notebook</title>
  <meta charset="utf-8" />
  <meta name="author" content="Sean Wang" />
  <meta name="description" content="awesome tools" />
  <meta name="keywords" content="github, repository" />

  <link rel="alternate" title="RSS Feed" href="/rss.xml" type="application/rss+xml">
  <link rel="stylesheet" href="/media/css/main.css" type="text/css">
  <link rel="stylesheet" href="/media/css/posts.css" type="text/css">

</head>

  <body class="container">
<header id="header">
    <body>
        <nav class="navbar navbar-default navbar-fixed-top" style="opacity: .9" role="navigation">
            <div class="container-fluid">
                <div class="navbar-header">
                    <button type="button" class="navbar-toggle" data-toggle="collapse" data-target="#bs-example-navbar-collapse-1">
                        <span class="sr-only">Toggle navigation</span>
                        <span class="icon-bar"></span>
                        <span class="icon-bar"></span>
                        <span class="icon-bar"></span>
                    </button>
                    <a class="navbar-brand" href="/">Sean Wang&#39;s Notebook</a>
                </div>
                <div class="collapse navbar-collapse" id="bs-example-navbar-collapse-1">
                    <ul class="nav navbar-nav navbar-right">
                            <li class="active"><a href="/blog/">Blog</a></li>
                            <li class="active"><a href="/english/">English</a></li>
                            <li class="active"><a href="/notes/">Notes</a></li>
                            <li class="active"><a href="/translation/">Translation</a></li>
                        <li><a href="/tags/">Tags</a></li>
                        <li><a href="/about/">About</a></li>
                        <li><a href="https://github.com/SparkWang">GitHub</a></li>
                        <li><a href="/rss.xml">RSS</a></li>
                    </ul>
                </div>
            </div>
        </nav>
    </body>
</header>

<section id="content" role="main">
    <div id="outline-container-sec-" class="row" style="padding-top: 70px">
        <div class="col-md-2"></div>
            <h1>Awesome Tools</h1>
            
<div id="outline-container-org719f3cd" class="outline-2">
<h2 id="org719f3cd">Percol</h2>
<div class="outline-text-2" id="text-org719f3cd">
<p>
Percol is a command line tool that adds flavor of interactive filtering to the
traditional pipe concept of UNIX shell.
</p>

<p>
on Github: <a href="https://github.com/mooz/percol.git"><a href="https://github.com/mooz/percol.git">https://github.com/mooz/percol.git</a></a>
</p>

<div class="org-src-container">
<pre class="src src-shell">git clone https://github.com/mooz/percol.git
</pre>
</div>
</div>
</div>

<div id="outline-container-orga8ce0a6" class="outline-2">
<h2 id="orga8ce0a6">oh-my-zsh</h2>
<div class="outline-text-2" id="text-orga8ce0a6">
<div class="org-src-container">
<pre class="src src-shell">sh -c "$(curl -fsSL https://raw.github.com/robbyrussell/oh-my-zsh/master/tools/install.sh)"
</pre>
</div>
</div>
</div>
<div id="outline-container-org4875c0c" class="outline-2">
<h2 id="org4875c0c">GNU Parallel</h2>
<div class="outline-text-2" id="text-org4875c0c">
<p>
GNU <b>parallel</b> is a shell tool for executing jobs in parallel using one or more
computers.
</p>

<p>
Downloading: <a href="http://ftp.gnu.org/gnu/parallel/"><a href="http://ftp.gnu.org/gnu/parallel/">http://ftp.gnu.org/gnu/parallel/</a></a> 
</p>
</div>
</div>
<div id="outline-container-orgc50eb47" class="outline-2">
<h2 id="orgc50eb47">tmux</h2>
<div class="outline-text-2" id="text-orgc50eb47">
<p>
A terminal multiplexer.
</p>

<p>
<a href="https://tmux.github.io"><a href="https://tmux.github.io">https://tmux.github.io</a></a>
</p>
</div>
</div>

    </div>
</section>


    <div class="post-meta">
        <span title="post date" class="post-info">2016-01-07</span>
        <span title="last modification date" class="post-info">2017-07-31</span>
        <span title="tags" class="post-info"><a href="/tags/github/">github</a></span>
        <span title="author" class="post-info">Sean Wang</span>
    </div>
<footer class="footer">
    <p>Generated by <a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.x (<a href="http://orgmode.org">Org mode</a> 9.x)</p>
    <p>
        Copyright &copy; 2012 - <span id="footerYear"></span> <a href="mailto:sean &lt;at&gt; think &lt;dot&gt; sean &lt;dot&gt; org">Sean Wang</a>
        &nbsp;&nbsp;-&nbsp;&nbsp;
        Powered by <a href="https://github.com/kelvinh/org-page" target="_blank">org-page</a>
        <script type="text/javascript">document.getElementById("footerYear").innerHTML = (new Date()).getFullYear();</script>
    </p>
</footer>

  </body>
</html>
